[{"fields": {"image": "items/2015/09/10/vim2_SQFTcM5.png", "name": "Skills", "description": "Programming skills"}, "model": "casestudy.casestudy", "pk": 1}, {"fields": {"image": "items/2015/09/10/goals_bRHBuIy.jpg", "name": "Goals", "description": "Improving the programmer in me!"}, "model": "casestudy.casestudy", "pk": 2}, {"fields": {"image": "items/2015/09/10/education_4z7LT8h.jpg", "name": "Education", "description": "Information towards my education."}, "model": "casestudy.casestudy", "pk": 3}, {"fields": {"image": "items/2015/09/10/personal_interests_2cIVfOd.jpg", "name": "Personal Interests", "description": "Hobbies and past time enjoyments."}, "model": "casestudy.casestudy", "pk": 4}, {"fields": {"casestudy": 1, "description": "Experience with Python, C++, Java, Javascript, PHP, Go, and mySQL. Some knowledge of Ocaml, Erlang, Forth, and Prolog. I like functional programming languages, they are different than object oriented programming. I have made Android Apps using Java, and am currently working on a personal project in PHP and MySQL. I have created a webpage using Javascript and developed a more exciting webpage using Javanscripts library jQuery.", "image": "items/2015/09/09/Programming-Languages.png", "title": "Programming Languages"}, "model": "casestudy.item", "pk": 2}, {"fields": {"casestudy": 1, "description": "Experience in HTML, CSS, and Bootstrap. Some experience in Javascript and JQuery. Experience in professional web design, and have created a couple of websites as personal projects. ", "image": "items/2015/09/09/bootstrap.png", "title": "Frameworks and Libraries"}, "model": "casestudy.item", "pk": 3}, {"fields": {"casestudy": 1, "description": "Excellent knowledge and extensive experience with VIM/GVIM, Git/GitHub, Terminal and OS X. Efficient and effective with three years of experience using VIM. Knowledge and efficient coding in Git. I have used Git to help me with errors by making branches and resetting my code to a previous commit. My experience with GitHub gives me the ability to code with others more efficiently. Some knowledge of Windows and Linux, but the main coding environment used for five years is OS X.  ", "image": "items/2015/09/09/vim_using.png", "title": "Tools and Enviorment"}, "model": "casestudy.item", "pk": 4}, {"fields": {"casestudy": 1, "description": "Experience in HTML, CSS, and Bootstrap. Some experience in Javascript and JQuery. Experience in professional web design, and have created a couple of websites as personal projects and more for work.", "image": "items/2015/09/09/web.jpg", "title": "Web Development"}, "model": "casestudy.item", "pk": 5}, {"fields": {"casestudy": 2, "description": "I understand the importance of personal projects and know that I gain in depth knowledge of programming languages through personal projects. I intend to work on personal projects this year.\r\nPersonal projects are a showcase for my work. Obtaining a degree in software engineering can only teach me the basics, but personal projects will extend this knowledge helping me become a skilled programmer.", "image": "items/2015/09/09/code.jpg", "title": "Personal Projects"}, "model": "casestudy.item", "pk": 6}, {"fields": {"casestudy": 2, "description": "Job shadowing will be beneficial in becoming acquainted with companies and the work place. By job shadowing, I will be able to observe the companies work environment and employees synergy to determine if that place would be a good fit for me. I will then be able to develop more in depth skills in that companies preferred language making it easier for me to catch on to the company projects.", "image": "items/2015/09/10/shadow_hands.JPG", "title": "Job Shadowing"}, "model": "casestudy.item", "pk": 7}, {"fields": {"casestudy": 2, "description": "I want to take more online classes and tutorials. Over the summer I took Udacity's (udacity.com) online course Full Stack Foundations and learned the framework Flask. At the end of the online course I began a personal project using Flask and created a restaurant website. Next, I want to learn more about Javascript and its library jQuery so when I am coding a project that requires Javascript, I will be more efficient and effective in my coding.\r\n\r\n", "image": "items/2015/09/10/tutorials.png", "title": "Extend My Knowledge"}, "model": "casestudy.item", "pk": 8}, {"fields": {"casestudy": 3, "description": "I am currently getting my degree in CIT (Computer Information Technologies) emphases in Software Development. My graduation date is spring 2017.", "image": "items/2015/09/10/vim.png", "title": "Bachelors in Software Development"}, "model": "casestudy.item", "pk": 9}, {"fields": {"casestudy": 3, "description": "I went to SUCCESS Academy, a early college high school. I got my high school diploma and associates of science spring 2014. I am dedicated and hardworking and graduated SUCCESS Academy and DSU with high honors. I maintained a 3.9 GPA on a 4.0 scale.", "image": "items/2015/09/10/graduation.jpg", "title": "Early College"}, "model": "casestudy.item", "pk": 10}, {"fields": {"casestudy": 4, "description": "It's not that I love cooking, it's that I love eating! Some of my favorites I bake are chocolate chip cookies, ginger snaps, lemon bars, and sugar cookies. When there is a party and everyone brings a finger food you can count on me to bring a home baked pastry. Dessert just tastes better when it is made from scratch.", "image": "items/2015/09/10/cookies.jpg", "title": "Making Pastries"}, "model": "casestudy.item", "pk": 11}, {"fields": {"casestudy": 4, "description": "I am a gamer and one of my favorite games is Zelda. The best time to play games is when friends can play too! When it comes to Mario Kart on the will I like to think of myself as a master.", "image": "items/2015/09/10/link.jpg", "title": "Zelda"}, "model": "casestudy.item", "pk": 12}, {"fields": {"casestudy": 4, "description": "I find genetics and biology fascinating! I love talking about genes and how they work. Biology is very captivating and it is one of the many classes I enjoyed in college along with Psychology and Communication. So don't bring Biology up if you don't want me to talk your ear off about genetics. I might just end up being a mad scientist! With the combination of Computers Science and Biology I will take over the world! ", "image": "items/2015/09/10/silly.jpg", "title": "Genetics and Biology"}, "model": "casestudy.item", "pk": 13}]